# Pandas

- its a python library used for working with datas
- it provides easy to use data structure 
- helps cleaning,manipulation and analysis 
- can easily import datasets from csv,excel,json and sql
- there are two primary data structures in pandas **Series** & **Dataframe**
- **Series** -> 1D labeled homogeneous array
- **DataFrame** -> 2d labeled heterogeneous table

In [1]:
import pandas as pd

# Series
- 1D single column data
- homogeneus -> usually stores one data type
- size immputable -> once created, the number of elements cannot change, but the values can be updated
- labled -> each elements has an index, default range index

In [44]:
s1 = pd.Series([10,20,30,40,50]) # used for creating single column data

s1.dtype

dtype('int64')

In [45]:
s1.values # used for checking values of the series

array([10, 20, 30, 40, 50])

In [48]:
s1.index #gives the index lables

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [47]:
index = ['a','b','c','d','f']

s1.index = index # also can change the index lables

s1

a    10
b    20
c    30
d    40
f    50
dtype: int64

In [50]:
s1.keys() # gives the index numbers or custom lables

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [53]:
s1['a':'c'] # in lable baased indexing the start value as well as the stop value also includes in the output
# in normal indexing the stop value will exclude in the out put

a    10
b    20
c    30
dtype: int64

In [54]:
s1.iloc[0] # accesse by integer position only it ignore lables always looks at the numeric position

np.int64(10)

In [68]:
s1.loc['a'] # access by index lables work with default numbers or custom lables

np.int64(10)

In [66]:
# the default name will be None
s1.name = "numbers" # we can assign a new name using .name
print(s1.name)
print(s1)

numbers
a    10
b    20
c    30
d    40
f    50
Name: numbers, dtype: int64

In [6]:
# creating a Series out of a dictionary
dict1 = {
    "apple":27,
    "orange":21,
    "banana":30,
    "grape":25,
    "pineapple":20,
    "strawberry":32,
    "blueberry":45,
    "jackfruit":26,
    "lemon":12,
    "avocado":28
}

s2 = pd.Series(dict1, name="fruits") 
print(s2.name)
print(s2)

fruits
apple         27
orange        21
banana        30
grape         25
pineapple     20
strawberry    32
blueberry     45
jackfruit     26
lemon         12
avocado       28
Name: fruits, dtype: int64

In [73]:
s2.loc[['orange','apple','banana']]

orange    21
apple     27
banana    30
Name: fruits, dtype: int64

In [74]:
s2.iloc[1:4]

orange    21
banana    30
grape     25
Name: fruits, dtype: int64

In [80]:
s2.iloc[[9,8,7]]

avocado      28
lemon        12
jackfruit    26
Name: fruits, dtype: int64

In [7]:
print(s2.keys())
print(s2.values)

Index(['apple', 'orange', 'banana', 'grape', 'pineapple', 'strawberry',
       'blueberry', 'jackfruit', 'lemon', 'avocado'],
      dtype='object')
[27 21 30 25 20 32 45 26 12 28]

In [87]:
extract = s2[s2>=28] # filtering series values using a condition called conditional selection
extract

banana        30
strawberry    32
blueberry     45
avocado       28
Name: fruits, dtype: int64

In [92]:
[(s2>20) & (s2<30)] # we need both condition meets true to get the result true

[apple          True
 orange         True
 banana        False
 grape          True
 pineapple     False
 strawberry    False
 blueberry     False
 jackfruit      True
 lemon         False
 avocado        True
 Name: fruits, dtype: bool]

In [94]:
s2["grape"]=100 # this is how we can modify a series
s2

apple          27
orange         21
banana         30
grape         100
pineapple      20
strawberry     32
blueberry      45
jackfruit      26
lemon          12
avocado        28
Name: fruits, dtype: int64

# DataFrame
- 2D structure multiple rows and columns
- hetrogeneous -> each column can have multiple data types
- size mutable -> can remove or add rows and columns
- rows can have index numbers (can be customized) columns can have names/lables
- tabular structure -> data is organized as a table format

In [88]:
import numpy as np

data = {
    "name":["jishnu","anusree","vishnu","abi"],
    "age":[26,26,16,np.nan],
    "department":["HR","sales","student","intern"],
    "sallery":[50000,25000,np.nan,10000]
}

df = pd.DataFrame(data)
df.index = ['a','b','c','d']
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [89]:
df.head(2) # to quickly view first few rows (works both in data frame and series)

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0

In [90]:
df.tail(3) # to quickly view last few rows (works both in data frame and sseries)

      name   age department  sallery
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [91]:
df.loc['a':'c' ,["department","sallery"]] # [rows , labeled indexing]

  department  sallery
a         HR  50000.0
b      sales  25000.0
c    student      NaN

In [92]:
df.iloc[2:4,1:3] # [rows,columns] in numerical indexing

    age department
c  16.0    student
d   NaN     intern

In [93]:
df["department"]

a         HR
b      sales
c    student
d     intern
Name: department, dtype: object

In [94]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [95]:
df.drop('age',axis=1,inplace=False) # used to remove rows or columns using lable (lable,axis,inplase = False by default 
# when inplace make True manually it will remove the entire row or column permenently

      name department  sallery
a   jishnu         HR  50000.0
b  anusree      sales  25000.0
c   vishnu    student      NaN
d      abi     intern  10000.0

In [162]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [167]:
df.loc['c','sallery']

np.float64(30000.0)

In [169]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student  30000.0
d      abi   NaN     intern  10000.0

In [19]:
import numpy as np

numbers  = np.arange(1,11)
s = pd.Series(numbers)

s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

- using columns.values[index number] and rename{columns = {column name : new name, inplace=True}
- mainly used for changing column names

In [102]:
s=np.arange(1,10).reshape(3,3)
b = pd.DataFrame(s)
b.index = ['a','b','c','d']

b.columns=['num1','num2','num3'] # used to change entire column names 
b.columns.values[0] = 'Name' # used to change a single column name
b.columns.values[2] = 'age'
b.rename(columns = {"num2":"adress"} , inplace = True) # used to change a single column name

b["sum"] = np.arange(1,4)
b["new"] = np.zeros(3)
c = b.iloc[1].tolist() # selecting single row using iloc
d = b["age"].tolist() 
f = b.iloc[:,3] # selecting single column using iloc
g = b.drop("sum",axis =1) # using drop to remove a column
h = b.drop('c',inplace = False)
print(b)
print()
print(f"single row {c}")
print()
print(f"single column {d}")
print()
print(f)
print(d)
print(g)
print(h)

   Name  adress  age  sum  new
a     1       2    3    1  0.0
b     4       5    6    2  0.0
c     7       8    9    3  0.0

single row [4.0, 5.0, 6.0, 2.0, 0.0]

single column [3, 6, 9]

a    1
b    2
c    3
Name: sum, dtype: int64
[3, 6, 9]
   Name  adress  age  new
a     1       2    3  0.0
b     4       5    6  0.0
c     7       8    9  0.0
   Name  adress  age  sum  new
a     1       2    3    1  0.0
b     4       5    6    2  0.0

In [103]:
b.info() # used to check informations about a data frame

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      int64
 1   adress  3 non-null      int64
 2   age     3 non-null      int64
 3   sum     3 non-null      int64
 4   new     3 non-null      float64
dtypes: float64(1), int64(4)
memory usage: 252.0+ bytes

In [104]:
b.describe() # used to check statistical informations of a data frame

       Name  adress  age  sum  new
count   3.0     3.0  3.0  3.0  3.0
mean    4.0     5.0  6.0  2.0  0.0
std     3.0     3.0  3.0  1.0  0.0
min     1.0     2.0  3.0  1.0  0.0
25%     2.5     3.5  4.5  1.5  0.0
50%     4.0     5.0  6.0  2.0  0.0
75%     5.5     6.5  7.5  2.5  0.0
max     7.0     8.0  9.0  3.0  0.0

In [112]:
arr = {
    "numbers" : [1,2,1,2,3,4,3,2,5,6,4,3,2,1]
}

df = pd.DataFrame(arr)
df["numbers"].unique() # to find unique values without duplicates
df["numbers"].nunique() # to find unique values count
df["numbers"].value_counts() # to find the frequency of each values

numbers
2    4
1    3
3    3
4    2
5    1
6    1
Name: count, dtype: int64

In [128]:
arr = {
    "name":["jishnu","vishnu"],
    "age":[26,np.nan]
}

df = pd.DataFrame(arr)
df.loc[2] = ['swetha',23] # also used for adding columns
df.loc[3] = ['abinav',25]
df.loc[4] = ['ajay',np.nan]
df["height"] = np.linspace(5,7,5) # used for adding new rows
df["sallery"] = np.linspace(10000,30000,5,dtype = int)
df["promotted sallery"] = df['sallery'] *2

df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  23.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [132]:
df.dropna(how = 'all')

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  23.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [141]:
df.fillna(0)

     name        age  height  sallery  promotted sallery
0  jishnu  26.000000     5.0    10000              20000
1  vishnu  24.666667     5.5    15000              30000
2  swetha  23.000000     6.0    20000              40000
3  abinav  25.000000     6.5    25000              50000
4    ajay  24.666667     7.0    30000              60000